In [2]:
import pandas as pd
import numpy as np
import sqlite3

In [3]:
data_cliente = pd.read_csv (r'./Cliente.csv')   
df_cliente = pd.DataFrame(data_cliente)
df_cliente.head()

,Unnamed: 0,customer_id,birthday,country,spanish_speaker,join_date,tier
0,0,4,09/25/1989,IN,False,08/18/2020,1. STANDARD
1,1,33,02/12/1943,AU,True,09/18/2020,5. EXCELSIOR
2,2,34,01/14/1949,IN,True,01/10/2022,3. GOLD
3,3,82,05/14/1999,BR,False,06/10/2020,2. BUSINESS
4,4,96,12/04/1938,IN,False,05/23/2023,3. GOLD

In [4]:
data_compra_puntos = pd.read_csv (r'./Compra_puntos.csv')   
df_compra_puntos= pd.DataFrame(data_compra_puntos)
df_compra_puntos.head()

   compra_id  customer_id fecha_compra  puntos_comprados
0     100896            4   05/15/2023                50
1     100275           33   01/21/2023                 5
2     100919           34   01/20/2023                50
3     100983           82   04/11/2023                20
4     100537           96   05/01/2023                15

In [6]:
data_marketing = pd.read_csv (r'./Marketing.csv')   
df_marketing= pd.DataFrame(data_marketing)
df_marketing.head()

   Unnamed: 0  customer_id permiso_email
0           0            4             N
1           1           33             Y
2           2           34             N
3           3           82             N
4           4           96             N

In [5]:
data_obtencion_puntos = pd.read_csv (r'./Obtencion_puntos.csv')   
df_obtencion_puntos= pd.DataFrame(data_obtencion_puntos)
df_obtencion_puntos.head()

,transaccion_id,customer_id,tipo_transaccion,fecha_transaccion,puntos_conseguidos,obtencion_puntos
0,12418,129,Obtención de puntos,09/02/2021,2,Pescado
1,12697,215,Obtención de puntos,08/20/2021,4,Verduras
2,13103,133,Obtención de puntos,01/09/2022,1,Lacteos
3,13564,231,Obtención de puntos,12/18/2021,15,Embutido
4,13766,587,Obtención de puntos,04/05/2021,11,Embutido

In [7]:
data_pescados = pd.read_csv (r'./Pescados.csv')   
df_pescados= pd.DataFrame(data_pescados)
df_pescados.head()

   pescado_id  transaccion_id tipo_pescado
0       21211           11685       dorada
1       20497           10840       Lubina
2       22236           10519       Lubina
3       21946           10683       Lubina
4       21653           11562       dorada

In [8]:
data_uso_puntos = pd.read_csv (r'./Uso_de_puntos.csv')   
df_uso_puntos= pd.DataFrame(data_uso_puntos)
df_uso_puntos.head()

,transaccion_id,customer_id,Tipo_transaccion,Fecha_transaccion,Puntos_utilizados,Uso_puntos
0,10262,177,Uso de puntos,06/20/2021,20,Verduras
1,11974,545,Uso de puntos,06/03/2022,35,Lacteos
2,11288,409,Uso de puntos,09/27/2021,23,Frutas
3,11642,231,Uso de puntos,05/21/2023,40,Embutido
4,11789,596,Uso de puntos,11/20/2022,42,Verduras

In [9]:
# Creamos la conexión para DB local

conn = sqlite3.connect("carrefive.db")

# Creamos el comando o cursor
cursor = conn.cursor()

In [10]:
import os

In [30]:
listado_directorio=os.listdir() #listado de archivos en 
listado_directorio

lista_csv=list(x for x in listado_directorio if x.endswith("csv"))
print(lista_csv)

['Cliente.csv', 'Compra_puntos.csv', 'Marketing.csv', 'Obtencion_puntos.csv', 'Pescados.csv', 'Uso_de_puntos.csv']

df_cliente  
df_compra_puntos  
df_marketing  
df_obtencion_puntos  
df_pescados  
df_uso_puntos

In [11]:
df_cliente.columns
df_cliente.head(1)

,Unnamed: 0,customer_id,birthday,country,spanish_speaker,join_date,tier
0,0,4,09/25/1989,IN,False,08/18/2020,1. STANDARD

In [56]:
df_cliente.drop('Unnamed: 0', inplace=True, axis=1)

KeyError: "['Unnamed: 0'] not found in axis"

In [38]:
cursor.execute(
    """
    /*
    Creamos la tabla en la base de datos 
    */
    CREATE TABLE IF NOT EXISTS CLIENTE (
        /* NULL es un valor nulo por defecto
            NOT NULL obliga a que el valor venga informado
        */
        
        customer_id INT
        ,birthday DATETIME
        ,country VARCHAR(50)
        ,spanish_speaker BOOL
        ,join_date DATETIME
        ,tier VARCHAR(10)
    
    );
  
    """
)

# Guardamos los cambios con el comando commmit
conn.commit()

In [59]:
df_cliente.values.tolist()

[[4, '09/25/1989', 'IN', False, '08/18/2020', '1. STANDARD'],
 [33, '02/12/1943', 'AU', True, '09/18/2020', '5. EXCELSIOR'],
 [34, '01/14/1949', 'IN', True, '01/10/2022', '3. GOLD'],
 [82, '05/14/1999', 'BR', False, '06/10/2020', '2. BUSINESS'],
 [96, '12/04/1938', 'IN', False, '05/23/2023', '3. GOLD'],
 [98, '10/21/1997', 'AU', True, '04/14/2023', '3. GOLD'],
 [104, '02/26/1967', 'IN', True, '10/05/2022', '4. PREMIUM'],
 [109, '04/16/1937', 'IT', False, '09/10/2022', '5. EXCELSIOR'],
 [117, '01/22/1935', 'FR', True, '02/25/2023', '1. STANDARD'],
 [120, '01/01/1940', 'US', False, '04/14/2022', '3. GOLD'],
 [129, '12/11/1948', 'SP', True, '06/24/2020', '2. BUSINESS'],
 [133, '04/07/1965', 'JP', False, '04/12/2022', '3. GOLD'],
 [177, '12/28/1966', 'SP', True, '06/06/2021', '3. GOLD'],
 [187, '03/24/1937', 'IT', True, '11/15/2021', '4. PREMIUM'],
 [188, '01/04/1987', 'DE', True, '03/12/2023', '1. STANDARD'],
 [205, '09/12/1950', 'IN', False, '08/23/2022', '4. PREMIUM'],
 [210, '10/26/1997', 'IN', False, '05/23/2021', '2. BUSINESS'],
 [215, '08/03/1998', 'IT', False, '06/09/2022', '4. PREMIUM'],
 [219, '03/09/1998', 'US', False, '08/07/2020', '4. PREMIUM'],
 [231, '12/07/1939', 'JP', True, '02/19/2022', '5. EXCELSIOR'],
 [233, '04/02/1948', 'FR', True, '04/10/2022', '5. EXCELSIOR'],
 [247, '04/08/1981', 'JP', False, '08/15/2020', '5. EXCELSIOR'],
 [249, '07/21/1965', 'FR', False, '04/24/2023', '1. STANDARD'],
 [253, '04/06/1985', 'IT', True, '05/03/2022', '5. EXCELSIOR'],
 [285, '08/16/1983', 'UK', True, '10/14/2020', '3. GOLD'],
 [290, '01/17/1952', 'FR', True, '04/10/2022', '2. BUSINESS'],
 [331, '02/02/1964', 'IN', False, '03/18/2022', '2. BUSINESS'],
 [401, '02/07/1947', 'AU', False, '11/13/2022', '1. STANDARD'],
 [409, '04/04/1985', 'AU', False, '10/04/2022', '3. GOLD'],
 [412, '10/17/1973', 'IT', True, '04/18/2022', '1. STANDARD'],
 [433, '05/01/1966', 'AU', False, '10/14/2021', '5. EXCELSIOR'],
 [444, '03/28/1964', 'JP', True, '10/06/2020', '2. BUSINESS'],
 [449, '11/23/2003', 'FR', False, '02/06/2022', '2. BUSINESS'],
 [464, '02/15/1947', 'US', False, '01/24/2023', '2. BUSINESS'],
 [493, '09/26/1962', 'IN', False, '05/10/2023', '1. STANDARD'],
 [505, '09/27/1963', 'BR', True, '10/09/2020', '2. BUSINESS'],
 [513, '10/21/1947', 'AU', False, '04/25/2023', '3. GOLD'],
 [529, '08/13/1967', 'IN', True, '05/16/2020', '4. PREMIUM'],
 [535, '01/21/1948', 'BR', False, '04/14/2020', '1. STANDARD'],
 [538, '10/05/1989', 'US', False, '03/11/2021', '5. EXCELSIOR'],
 [542, '09/16/1981', 'DE', False, '12/04/2022', '2. BUSINESS'],
 [545, '04/09/1977', 'SP', True, '09/04/2021', '4. PREMIUM'],
 [560, '05/14/1968', 'IN', True, '04/27/2022', '1. STANDARD'],
 [563, '11/20/1971', 'DE', False, '12/01/2020', '3. GOLD'],
 [571, '05/08/1950', 'JP', False, '04/07/2022', '5. EXCELSIOR'],
 [586, '05/13/1985', 'IN', True, '06/21/2022', '1. STANDARD'],
 [587, '04/23/1976', 'UK', True, '04/10/2021', '4. PREMIUM'],
 [596, '03/12/2000', 'IT', True, '12/24/2020', '5. EXCELSIOR'],
 [597, '11/26/1997', 'JP', True, '11/02/2022', '1. STANDARD'],
 [600, '09/03/1948', 'IT', False, '05/17/2023', '1. STANDARD']]

In [60]:
cursor.executemany("INSERT INTO CLIENTE VALUES (?,?,?,?,?,?)", df_cliente.values.tolist())

In [64]:
q = """
    SELECT *
    FROM CLIENTE
"""
df = pd.read_sql(q, conn)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      50 non-null     int64
 1   birthday         50 non-null     object
 2   country          50 non-null     object
 3   spanish_speaker  50 non-null     int64
 4   join_date        50 non-null     object
 5   tier             50 non-null     object
dtypes: int64(2), object(4)
memory usage: 2.5+ KB

In [39]:
tables = pd.read_sql(""" select *
                        from sqlite_master 
                        where type='table'
                        order by name;
                        """, conn)

In [43]:
tables

,type,name,tbl_name,rootpage,sql
0,table,CLIENTE,CLIENTE,2,CREATE TABLE CLIENTE (\n /* NULL es un ...

In [65]:
cursor.execute(
    """
    /*
    Creamos la tabla en la base de datos 
    */
    CREATE TABLE IF NOT EXISTS COMPRA_PUNTOS (
        /* NULL es un valor nulo por defecto
            NOT NULL obliga a que el valor venga informado
        */
        
       compra_id INT
       ,customer_id INT
       ,fecha_compra DATETIME
       ,puntos_comprados INT
    );
  
    """
)

# Guardamos los cambios con el comando commmit
conn.commit()

In [66]:
cursor.execute(
    """
    /*
    Creamos la tabla en la base de datos 
    */
    CREATE TABLE IF NOT EXISTS MARKETING (
        /* NULL es un valor nulo por defecto
            NOT NULL obliga a que el valor venga informado
        */
       customer_id INT
       ,permiso_email VARCHAR(3)
    );
  
    """
)

# Guardamos los cambios con el comando commmit
conn.commit()

In [72]:
cursor.execute(
    """
    /*
    Creamos la tabla en la base de datos 
    */

    CREATE TABLE IF NOT EXISTS OBTENCION_PUNTOS (
        /* NULL es un valor nulo por defecto
            NOT NULL obliga a que el valor venga informado
        */

       transaccion_id INT
       ,customer_id INT
       ,tipo_transaccion VARCHAR(25)
       ,fecha_transaccion DATETIME
       ,puntos_conseguidos INT
       ,obtencion_puntos VARCHAR(25)
    );
    """
)

# Guardamos los cambios con el comando commmit
conn.commit()

In [92]:
cursor.execute(
    """
    /*
    Creamos la tabla en la base de datos 
    */

 CREATE TABLE IF NOT EXISTS PESCADOS (
       pescado_id INT
       ,customer_id INT
       ,permiso_email VARCHAR(3)


    );

    """
)

# Guardamos los cambios con el comando commmit
conn.commit()

In [75]:
cursor.execute(
    """
    /*
    Creamos la tabla en la base de datos 
    */

    CREATE TABLE IF NOT EXISTS USO_DE_PUNTOS (

       transaccion_id INT
       ,customer_id INT
       ,tipo_transaccion VARCHAR(25)
       ,fecha_transaccion DATETIME
       ,puntos_utilizados INT
       ,uso_puntos VARCHAR(25)

    );

    """
)

# Guardamos los cambios con el comando commmit
conn.commit()

In [ ]:
#cursor.executemany("INSERT INTO CLIENTE VALUES (?,?,?,?,?,?)", df_cliente.values.tolist())

In [76]:
cursor.executemany("INSERT INTO COMPRA_PUNTOS VALUES (?,?,?,?)", df_compra_puntos.values.tolist())

In [82]:
df_marketing.drop('Unnamed: 0', axis=1, inplace=True)

In [85]:
cursor.executemany("INSERT INTO MARKETING VALUES (?,?)", df_marketing.values.tolist())

In [94]:
cursor.executemany("INSERT INTO OBTENCION_PUNTOS VALUES (?,?,?,?,?,?)", df_obtencion_puntos.values.tolist())

In [98]:
cursor.executemany("INSERT INTO USO_DE_PUNTOS VALUES (?,?,?,?,?,?)", df_uso_puntos.values.tolist())

In [14]:
q = """
    SELECT *
    FROM PESCADOS
"""
df = pd.read_sql(q, conn)
df

Empty DataFrame
Columns: [pescado_id, customer_id, permiso_email]
Index: []

In [17]:
cursor.executemany("INSERT INTO PESCADOS VALUES (?,?,?)", df_pescados.values.tolist())

> SELECTS